In [1]:
import pandas as pd

In [2]:
data = {'coluna1': [1, 2, 3, 3, 4, 4],
        'coluna2': ['a', 'b', 'c', 'c', 'd', 'e']}

In [3]:
df = pd.DataFrame(data)
df

   coluna1 coluna2
0        1       a
1        2       b
2        3       c
3        3       c
4        4       d
5        4       e

In [4]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
dtype: bool

In [5]:
df.drop_duplicates()

   coluna1 coluna2
0        1       a
1        2       b
2        3       c
4        4       d
5        4       e

In [11]:
df.drop_duplicates(subset=['coluna1'],keep='last').sort_values()

   coluna1 coluna2
5        4       e
3        3       c
1        2       b
0        1       a

eliminem as duplicatas do dataframe  em função da coluna valor e da coluna data, e digam a diferença.

In [12]:
dados={'valor':[18.3,10.1,14.32,17.52,16.31,81.14,17.52,16.31,81.14,18.3,10.1,14.32],'data': ['2022/01/01', '2022/01/02', '2022/01/03','2022/01/01', '2022/01/02', '2022/01/03','2022/01/01', '2022/01/02', '2022/01/03','2022/01/01', '2022/01/02', '2022/01/03'], 'entrada ou saída':['entrada','entrada','entrada','Saída','Saída','Saída','Saída','Saída','Saída','entrada','entrada','entrada']}

In [13]:
df = pd.DataFrame(dados)
df

    valor        data entrada ou saída
0   18.30  2022/01/01          entrada
1   10.10  2022/01/02          entrada
2   14.32  2022/01/03          entrada
3   17.52  2022/01/01            Saída
4   16.31  2022/01/02            Saída
5   81.14  2022/01/03            Saída
6   17.52  2022/01/01            Saída
7   16.31  2022/01/02            Saída
8   81.14  2022/01/03            Saída
9   18.30  2022/01/01          entrada
10  10.10  2022/01/02          entrada
11  14.32  2022/01/03          entrada

In [15]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8      True
9      True
10     True
11     True
dtype: bool

In [19]:
df.drop_duplicates(subset=['valor']).sort_values('valor',ascending=False)

   valor        data entrada ou saída
5  81.14  2022/01/03            Saída
0  18.30  2022/01/01          entrada
3  17.52  2022/01/01            Saída
4  16.31  2022/01/02            Saída
2  14.32  2022/01/03          entrada
1  10.10  2022/01/02          entrada

 ## Datas

In [21]:
datas = {'data': ['2022-01-01', '2022-01-02', '2022-01-03']}
df = pd.DataFrame(datas)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    3 non-null      object
dtypes: object(1)
memory usage: 152.0+ bytes

In [24]:
df['data'] = pd.to_datetime(df['data'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 152.0 bytes

In [25]:
df['ano'] = df['data'].dt.year
df['mes'] = df['data'].dt.month
df['dia'] = df['data'].dt.day
df['dia_da_semana'] = df['data'].dt.day_name()
df

        data   ano  mes  dia dia_da_semana
0 2022-01-01  2022    1    1      Saturday
1 2022-01-02  2022    1    2        Sunday
2 2022-01-03  2022    1    3        Monday

In [26]:
df['prox_data'] = df['data'] +pd.DateOffset(days=7)
df

        data   ano  mes  dia dia_da_semana  prox_data
0 2022-01-01  2022    1    1      Saturday 2022-01-08
1 2022-01-02  2022    1    2        Sunday 2022-01-09
2 2022-01-03  2022    1    3        Monday 2022-01-10

In [28]:
datas_2 = {'data': ['2022/01/01', '2022/01/02', '2022/01/03']}
df2 = pd.DataFrame(datas_2)
df2

         data
0  2022/01/01
1  2022/01/02
2  2022/01/03

In [29]:
df2['data'] = pd.to_datetime(df2['data'],format='%Y/%m/%d')
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 152.0 bytes

Exercício: Para cada data no DataFrame, crie três novas colunas: uma para o mês, outra para o ano e outra para o dia.

In [30]:
data = {
    'datas': ['15/01/2024', '20/02/2024', '25/03/2024', '30/04/2024', '10/05/2024']
}

In [31]:
df = pd.DataFrame(data)
df

        datas
0  15/01/2024
1  20/02/2024
2  25/03/2024
3  30/04/2024
4  10/05/2024

In [35]:
df['datas'] = pd.to_datetime(df['datas'],format='%d/%m/%Y')
df

       datas
0 2024-01-15
1 2024-02-20
2 2024-03-25
3 2024-04-30
4 2024-05-10

In [37]:
df['ano'] = df['datas'].dt.year
df['mes'] = df['datas'].dt.month
df['dia'] = df['datas'].dt.day
df

       datas   ano  mes  dia
0 2024-01-15  2024    1   15
1 2024-02-20  2024    2   20
2 2024-03-25  2024    3   25
3 2024-04-30  2024    4   30
4 2024-05-10  2024    5   10

In [38]:
df['nome_do_mes'] = df['datas'].dt.strftime('%B')
df

       datas   ano  mes  dia nome_do_mes
0 2024-01-15  2024    1   15     January
1 2024-02-20  2024    2   20    February
2 2024-03-25  2024    3   25       March
3 2024-04-30  2024    4   30       April
4 2024-05-10  2024    5   10         May

In [42]:
fastfood = pd.read_excel('../datasets/fastfood.xlsx')
fastfood.head(1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 515 entries, 0 to 514
Data columns (total 17 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   restaurant   515 non-null    object
 1   item         515 non-null    object
 2   calories     515 non-null    int64
 3   cal_fat      515 non-null    int64
 4   total_fat    515 non-null    int64
 5   sat_fat      515 non-null    object
 6   trans_fat    515 non-null    object
 7   cholesterol  515 non-null    int64
 8   sodium       515 non-null    int64
 9   total_carb   515 non-null    int64
 10  fiber        503 non-null    float64
 11  sugar        515 non-null    int64
 12  protein      514 non-null    float64
 13  vit_a        301 non-null    float64
 14  vit_c        305 non-null    float64
 15  calcium      305 non-null    float64
 16  salad        515 non-null    object
dtypes: float64(5), int64(7), object(5)
memory usage: 68.5+ KB

In [51]:
fastfood.groupby('restaurant')['calories'].agg(['max','min'])

              max  min
restaurant
Arbys        1030   70
Burger King  1550  190
Chick Fil-A   970   70
Dairy Queen  1260   20
Mcdonalds    2430  140
Sonic        1350  100
Subway       1160   50
Taco Bell     880  140

In [58]:
fastfood.sort_values(['restaurant','calories'],ascending=False)

,restaurant,item,calories,cal_fat,total_fat,sat_fat,trans_fat,cholesterol,sodium,total_carb,fiber,sugar,protein,vit_a,vit_c,calcium,salad
430,Taco Bell,XXL Grilled Stuft Burrito - Beef,880,380,42,14,1,75,2020,94,12.0,6,31.0,NaN,NaN,NaN,Other
431,Taco Bell,XXL Grilled Stuft Burrito - Chicken,830,320,35,11,0,85,1940,91,10.0,6,37.0,NaN,NaN,NaN,Other
432,Taco Bell,XXL Grilled Stuft Burrito - Steak,820,320,36,12,1,70,2020,91,10.0,7,33.0,NaN,NaN,NaN,Other
411,Taco Bell,Cantina Power Burrito - Steak,780,250,28,7,0,50,1900,98,13.0,7,33.0,NaN,NaN,NaN,Other
510,Taco Bell,Spicy Triple Double Crunchwrap,780,340,38,10,0.5,50,1850,87,9.0,8,23.0,20.0,10.0,25.0,Other
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
190,Arbys,Roast Turkey Farmhouse Salad,230,120,13,7,0,55,870,8,2.0,5,22.0,60.0,20.0,25.0,Other
181,Arbys,Corned Beef 'n Cheese Slider,220,80,9,2023-05-03 00:00:00,0,30,890,21,1.0,1,14.0,NaN,NaN,NaN,Other
182,Arbys,Ham 'n Cheese Slider,210,70,8,3,0,25,780,21,1.0,2,13.0,NaN,NaN,NaN,Other
186,Arbys,Turkey 'n Cheese Slider,200,60,7,2023-05-02 00:00:00,0,25,760,21,1.0,2,14.0,NaN,NaN,NaN,Other
187,Arbys,Chopped Side Salad,70,45,5,2023-05-02 00:00:00,0,15,100,4,1.0,2,5.0,35.0,10.0,10.0,Other

In [59]:
data = {'coluna1': [1, 2, 3, 4, 5],
        'coluna2': ['a', 'b', 'c', 'd', 'e']}

df  = pd.DataFrame(data)
df

   coluna1 coluna2
0        1       a
1        2       b
2        3       c
3        4       d
4        5       e

In [62]:
df_sample_1=df.sample(n=3,random_state=42)
df_sample_1

   coluna1 coluna2
1        2       b
4        5       e
2        3       c

In [66]:
df_sample_2=df.sample(n=3,random_state=43)
df_sample_2

   coluna1 coluna2
3        4       d
2        3       c
1        2       b

In [68]:
pd.concat([df_sample_1,df_sample_2],ignore_index=True)

   coluna1 coluna2
0        2       b
1        5       e
2        3       c
3        4       d
4        3       c
5        2       b

Utilizando a base "realtor-data.csv" gerar uma amostra com os seguintes requisitos:

amostra aleatória
com 1.000 registros, sendo:
250 do estado de Massachusetts
250 do estado de Puerto Rico
250 do estado de Connecticut
250 dos estados Rhode Island e New York
somente casas for_sale
sem duplicidades de status, city, state e price
na remoção de duplicados priorizar as casas maiores.
Valide a amostra criada.

In [112]:
realtor = pd.read_csv('../datasets/realtor-data.csv')
realtor.head(3)

,status,bed,bath,acre_lot,city,state,zip_code,house_size,prev_sold_date,price
0,for_sale,3.0,2.0,0.12,Adjuntas,Puerto Rico,601.0,920.0,NaN,105000.0
1,for_sale,4.0,2.0,0.08,Adjuntas,Puerto Rico,601.0,1527.0,NaN,80000.0
2,for_sale,2.0,1.0,0.15,Juana Diaz,Puerto Rico,795.0,748.0,NaN,67000.0

In [113]:
realtor.shape

(100000, 10)

In [114]:
realtor.groupby('status').count()[['price']]

                price
status
for_sale        99819
ready_to_build    181

In [115]:
realtor.groupby('state').count()['price'].sort_values(ascending=False)

state
Massachusetts     52694
Puerto Rico       24679
Connecticut       12178
Virgin Islands     2573
Rhode Island       2401
New Hampshire      2232
New York           1874
Vermont            1324
South Carolina       24
Tennessee            16
Virginia              3
New Jersey            2
Name: price, dtype: int64

In [116]:
realtor_fs = realtor[realtor['status'] == 'for_sale']
realtor_fs.shape

(99819, 10)

In [117]:
realtor_fs = realtor_fs.sort_values('house_size')

In [118]:
realtor_dup = realtor_fs.drop_duplicates(['status','city','state','price'],keep='last')
realtor_dup.shape

(12067, 10)

In [119]:
massachusetts = realtor_dup[realtor_dup['state']== 'Massachusetts']
massachusetts.shape

(3349, 10)

In [120]:
puerto_rico = realtor_dup[realtor_dup['state']== 'Puerto Rico']
puerto_rico.shape

(2207, 10)

In [121]:
connecticut = realtor_dup[realtor_dup['state']== 'Connecticut']
connecticut.shape

(3111, 10)

In [122]:
rhode_island_new_york = realtor_dup[realtor_dup['state'].isin(['Rhode Island','New York'])]
rhode_island_new_york.shape

(2149, 10)

In [123]:
massachusetts_sample = massachusetts.sample(n=250,random_state=42)
puerto_rico_sample = puerto_rico.sample(n=250, random_state=42)
connecticut_sample = connecticut.sample(n=250, random_state=42)
rhode_island_new_york_sample = rhode_island_new_york.sample(n=250, random_state=42)

In [124]:
amostra = pd.concat([massachusetts_sample,puerto_rico_sample,connecticut_sample,rhode_island_new_york_sample],ignore_index=True)
amostra.shape

(1000, 10)

Validar

In [125]:
amostra.groupby(['status','state'])[['price']].count()

                        price
status   state
for_sale Connecticut      250
         Massachusetts    250
         New York          84
         Puerto Rico      250
         Rhode Island     166